InformationRegisters/ИА_УведомленияКЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_УведомленияКЦ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_УведомленияКЦ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаУдлитьВсе.Видимость = Ложь;
	
	Если Параметры.Фильтр Тогда
		Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
		Элемент.Использование = истина;
		
		Элементы.ФормаУдлитьВсе.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("ИА_ОбновитьУведомления");
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = ПолучитьЗадачу(ВыбраннаяСтрока);
	ПоказатьЗначение(,Задача);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗадачу(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.Задача;
КонецФункции

&НаСервере
Процедура УдалитьВсеНаСервере()
	Набор = РегистрыСведений.ИА_УведомленияКЦ.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Отбор.Пользователь.Использование = истина;
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		УдалитьВсеНаСервере();
		Оповестить("ИА_ОбновитьУведомления");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
